"use strict";

// Задачи на основы работы с массивами и объектами

// Примеры решения задач:
// Задача #3

// let arr = ['Привет', ', ', 'мир!'];
// arr[0] = 'Пока';
// alert(arr);

// Задача #4

// let obj = {'Коля':'1000', 'Вася':'500', 'Петя':'200'};
// alert(obj['Вася']);

// Задача #5

// let arr = ['1', '2', '3', '4', '5'];

// let arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// arr[3] = 4;
// arr[4] = 5;

// Задача #6
// let arr = {
// 	'ru':['голубой', 'красный', 'зеленый'],
// 	'en':['blue', 'red', 'green'],
// };

// alert(arr['ru'][2]);

// Задачи для решения
// Работа с массивами:
// Задача #1

// let arr = ['a', 'b', 'c'];
// alert(arr);

// Задача #2
//  let arr = ['a', 'b', 'c'];
//  alert(arr [0]);
//  alert(arr [1]);
//  alert(arr [2]);

// Задача #3
// let arr = ['a', 'b', 'c', 'd'];
// alert(arr[0] + '+'  + arr[1] + ', ' + arr[2] + '+' + arr[3]);

// Задача #4
// let arr = [2, 5, 3, 9];
// let result = arr[0] * arr[1] + arr[2] * arr[3];
// alert(result);

// Объекты (ассоциативные массивы)
// Задача #5

// var obj = {a: 1, b: 2, c: 3};
// alert(obj[1]);

// Задача #6
// var obj = {Коля: '1000', Вася: '500', Петя: '200'};
// alert(obj['Петя']);
// alert(obj['Коля']);

// Задача #7
// let obj = {
//     '1': 'понедельник',
//     '2': 'вторник',
//     '3': 'среда',
//     '4': 'четверг',
//     '5': 'пятница',
//     '6': 'суббота',
//     '7': 'воскресенье'
// }
// let day = '3';
// alert( obj[day] );

// Многомерные массивы
// Задача #9
// let arr = [ [1, 2, 3], [4, 5, 6], [7,8,9] ];
// alert(arr[1][0]);

// Задача #10
// let a = {js:['jQuery', 'Angular'], php: 'hello', css: 'world'};
// alert(a.js[1]);

// Задача #11
// let arr = {
//     'ru':['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
//     'en':['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
// };
// alert(arr.ru[0] + ' ' + arr.en[2]);

// Задача #12
// let arr = {
//     'ru':['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
//     'en':['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
// };
// let lang = [arr.ru, arr.en];
// let day = lang[1][4];
// alert(day);

let arr = {
    'ru':['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'],
    'en':['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
};
let lang = 'ru';
let day = '2';
alert(arr[lang][day]);
